#%%
import batch_common as bc
from os import system


#%%
bc.setup_gsi_nummap_on_db('52397[34]')
bc.setup_landnuminfo_on_db('14')
bc.create_dem_vrt('52397[34]')

#%%
# # wide area
# tiles = [
#     (14, 14539, 6471), (14, 14540, 6471), (14, 14541, 6471), (14, 14542, 6471), (14, 14543, 6471),
#     (14, 14539, 6472), (14, 14540, 6472), (14, 14541, 6472), (14, 14542, 6472), (14, 14543, 6472),
#     (14, 14539, 6473), (14, 14540, 6473), (14, 14541, 6473), (14, 14542, 6473), (14, 14543, 6473)
# ]
# core area
tiles = [
    (15, 29079, 12944),  # 片瀬海岸
    (15, 29080, 12944),  # 龍口寺
    (15, 29081, 12944),  # 津西
    (15, 29079, 12945),  # 江の島参道
    (15, 29080, 12945),  # 湘南港
    (15, 29081, 12945),  # 鎌倉高校前
    (15, 29079, 12946),  # 江の島岩屋
    (15, 29080, 12946),  # 江の島灯台
#     (15, 29082, 12944),
#     (15, 29082, 12945),
#     (15, 29083, 12944),
#     (15, 29083, 12945),
#     (15, 29084, 12944),
#     (15, 29084, 12945),
]

#%%
# bc.create_tiled_objs(tiles)
bc.convert_to_tiled_b3dms(tiles, '~enoshima')
bc.convert_to_tiled_gltfs(tiles, '~enoshima')

#%%
bc.seam_dems_for_cesium_terrain(tiles, '~enoshima_dem.tif')

#%%
system('rm -f ??_*_*.*')
system('rm ~*.*')


#%%
